s.apply(func, convert_dtype=True, args=())
func: .apply takes a function and applies it to all values of pandas series. convert_dtype: Convert dtype as per the function’s operation. args=(): Additional arguments to pass to function instead of series. Return Type: Pandas Series after applied function/operation.

In [2]:
import pandas as pd

In [6]:
df=pd.read_csv("C:/Users/HP/Downloads/nba.csv")
df.head()
df["Number"].min()
df["Number"].max()

np.float64(99.0)

In [7]:
# defining function to check price
def fun(num):
 
    if num<25:
        return "Low"
 
    elif num>= 25 and num<75:
        return "Normal"
 
    else:
        return "High"
 
# passing function to apply and storing returned series in new
new = df["Number"].apply(fun)
 
# printing first 3 element
print(new.head(3))

0       Low
1      High
2    Normal
Name: Number, dtype: object

In [8]:

# adding 5 to each value
new = df["Age"].apply(lambda num : num + 5)

# printing first 5 elements of old and new series
print(df.head(), '\n', new.head())

# printing last 5 elements of old and new series
print('\n\n', df.tail(), '\n', new.tail())

            Name            Team  Number Position   Age Height  Weight  \
0  Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
1    Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0
2   John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0
3    R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0
4  Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0

             College     Salary
0              Texas  7730337.0
1          Marquette  6796117.0
2  Boston University        NaN
3      Georgia State  1148640.0
4                NaN  5000000.0
 0    30.0
1    30.0
2    32.0
3    27.0
4    34.0
Name: Age, dtype: float64


              Name       Team  Number Position   Age Height  Weight College  \
453  Shelvin Mack  Utah Jazz     8.0       PG  26.0    6-3   203.0  Butler
454     Raul Neto  Utah Jazz    25.0       PG  24.0    6-1   179.0     NaN
455  Tibor Pleiss  Utah Jazz    21.0        C  26.0    7-3   256.0     NaN
456   Jeff Withey  Utah Jazz    24.0        C  26.0    7-0   231.0  Kansas
457           NaN        NaN     NaN      NaN   NaN    NaN     NaN     NaN

        Salary
453  2433333.0
454   900000.0
455  2900000.0
456   947276.0
457        NaN
 453    31.0
454    29.0
455    31.0
456    31.0
457     NaN
Name: Age, dtype: float64

TO APPLY A FUNCTION TO EVERY ROW IN DATAFRAME

In [9]:
import pandas as pd

# Function to add
def add_values(row):
	return row['A'] + row['B'] + row['C']


data = {
		'A': [1, 2, 3],
		'B': [4, 5, 6],
		'C': [7, 8, 9]}

# Convert the dictionary into DataFrame
df = pd.DataFrame(data)
print("Original DataFrame:\n", df)

# Apply the user-defined function to every row
df['add'] = df.apply(add_values, axis=1)

print('\nAfter Applying Function: ')
print(df)

Original DataFrame:
    A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

After Applying Function:
   A  B  C  add
0  1  4  7   12
1  2  5  8   15
2  3  6  9   18

In [16]:
# passing the parameters in the function

# Import pandas package
import pandas as pd
# Function to add

def add(a, b, c):
	return a + b + c


data = {
		'A': [1, 2, 3],
		'B': [4, 5, 6],
		'C': [7, 8, 9]}

	# Convert the dictionary into DataFrame
df = pd.DataFrame(data)
print("Original DataFrame:\n", df)

df['add'] = df.apply(lambda row: add(row['A'],
                                         row['B'], row['C']), axis=1)

#   df['add'] = df.apply(np.sum, axis=1)

print('\nAfter Applying Function: ')
	# printing the new dataframe
print(df)

Original DataFrame:
    A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

After Applying Function:
   A  B  C  add
0  1  4  7   12
1  2  5  8   15
2  3  6  9   18

Dataframe.aggregate() function is used to apply some aggregation across one or more columns.

Syntax: DataFrame.aggregate(func, axis=0, *args, **kwargs)

Parameters:

func : callable, string, dictionary, or list of string/callables. Function to use for aggregating the data. If a function, must either work when passed a DataFrame or when passed to DataFrame.apply. For a DataFrame, can pass a dict, if the keys are DataFrame column names.
axis : (default 0) {0 or ‘index’, 1 or ‘columns’} 0 or ‘index’: apply function to each column. 1 or ‘columns’: apply function to each row.
Returns: Aggregated DataFrame

In [22]:
df=pd.read_csv("C:/Users/HP/Downloads/nba.csv")
# Applying aggregation across all the columns 
df.dropna(inplace=True)
df.aggregate(['sum','min'])

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
sum,Avery BradleyJae CrowderR.J. HunterJordan Mick...,Boston CelticsBoston CelticsBoston CelticsBost...,6126.0,PGSFSGPFCPGPGCPGSGSGCSGSGSGPGSGPGCPFPFPFCPGPFS...,9688.0,6-26-66-56-87-06-26-46-95-96-76-67-06-36-46-76...,80002.0,TexasMarquetteGeorgia StateLSUGonzagaLouisvill...,1.681793e+09
min,Aaron Brooks,Atlanta Hawks,0.0,C,19.0,5-11,161.0,Alabama,5.572200e+04

In [23]:
# We are going to find aggregation for these columns 
df.aggregate({"Number":['sum', 'min'], 
              "Age":['max', 'min'], 
              "Weight":['min', 'sum'],  
              "Salary":['sum']})

     Number   Age   Weight        Salary
sum  6126.0   NaN  80002.0  1.681793e+09
min     0.0  19.0    161.0           NaN
max     NaN  40.0      NaN           NaN

Pandas Series.value_counts() function return a Series containing counts of unique values. The resulting object will be in descending order so that the first element is the most frequently-occurring element. Excludes NA values by default.

Syntax: Series.value_counts(normalize=False, sort=True, ascending=False, bins=None, dropna=True)

Parameter :
normalize : If True then the object returned will contain the relative frequencies of the unique values.
sort : Sort by values.
ascending : Sort in ascending order.
bins : Rather than count values, group them into half-open bins, a convenience for pd.cut, only works with numeric data.
dropna : Don’t include counts of NaN.

Returns : counts : Series

In [25]:

sr = pd.Series(['New York', 'Chicago', 'Toronto', 'Lisbon', 'Rio', 'Chicago', 'Lisbon']) 

# Print the series 
print(sr)
# find the value counts 
sr.value_counts()

0    New York
1     Chicago
2     Toronto
3      Lisbon
4         Rio
5     Chicago
6      Lisbon
dtype: object

Chicago     2
Lisbon      2
New York    1
Toronto     1
Rio         1
Name: count, dtype: int64

unique()
The unique() method returns the unique values in a pandas Series or DataFrame column.

In [31]:
df = pd.DataFrame({
    'A': [1, 'b', 2, 4],
    'B': ['a', 'b', 'b', 'c']
})

unique_values_A = df['A'].unique()
print(unique_values_A)  # Output: [1 2 4]

# Unique values in column B
unique_values_B = df['B'].unique()
print(unique_values_B)  # Output: ['a' 'b' 'c']

[1 'b' 2 4]
['a' 'b' 'c']

nunique()
The nunique() method returns the number of unique values in a pandas Series or DataFrame. It can also be applied across different axes.

df.nunique(axis=0)  # Count unique values for each column
df.nunique(axis=1)  # Count unique values for each row

In [32]:
nunique_A = df['A'].nunique()
print(nunique_A)  # Output: 3
print('--------------------------------------------')
nunique_A = df.nunique(axis=1)
print(nunique_A)  
print('--------------------------------------------')
# Number of unique values in column B
nunique_B = df['B'].nunique()
print(nunique_B)  # Output: 3
print('--------------------------------------------')
# Number of unique values in each column
nunique_df = df.nunique()
print(nunique_df)  # Output: A    3
                   #          B    3
                   #          dtype: int64

4
--------------------------------------------
0    2
1    1
2    2
3    2
dtype: int64
--------------------------------------------
3
--------------------------------------------
A    4
B    3
dtype: int64